Revit 2024 API
PostDocEventArgs Members
The PostDocEventArgs type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancel
 Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
 (Inherited from RevitEventArgs.)
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitEventArgs.)
Document
 The document associated with the event.
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
 (Inherited from PostEventArgs.)
See Also
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace